{
  "format": "layers-model",
  "generatedBy": "keras v3.7.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.7.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": { "name": "float32" }
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [ null, 13, 100 ], // batch_shape → batch_input_shape로 변경
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_1"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" }
              },
              "filters": 32,
              "kernel_size": [ 3 ],
              "strides": [ 1 ],
              "padding": "same",
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" }
              },
              "pool_size": [ 2 ],
              "padding": "valid",
              "strides": [ 2 ]
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": true,
              "filters": 64,
              "kernel_size": [ 3 ],
              "strides": [ 1 ],
              "padding": "same",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_3",
              "trainable": true,
              "pool_size": [ 2 ],
              "strides": [ 2 ]
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_5",
              "trainable": true,
              "filters": 128,
              "kernel_size": [ 3 ],
              "strides": [ 1 ],
              "padding": "same",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_4",
              "trainable": true,
              "pool_size": [ 2 ],
              "strides": [ 2 ]
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 4,
              "activation": "softmax"
            }
          }
        ],
        "build_input_shape": [ null, 13, 100 ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": [ "accuracy" ],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [ "group1-shard1of1.bin" ],
      "weights": [
        {
          "name": "sequential_1/conv1d_3/kernel",
          "shape": [ 3, 100, 32 ]
        },
        {
          "name": "sequential_1/conv1d_3/bias",
          "shape": [ 32 ]
        },
        {
          "name": "sequential_1/conv1d_4/kernel",
          "shape": [ 3, 32, 64 ]
        },
        {
          "name": "sequential_1/conv1d_4/bias",
          "shape": [ 64 ]
        },
        {
          "name": "sequential_1/conv1d_5/kernel",
          "shape": [ 3, 64, 128 ]
        },
        {
          "name": "sequential_1/conv1d_5/bias",
          "shape": [ 128 ]
        },
        {
          "name": "sequential_1/dense/kernel",
          "shape": [ 128, 128 ]
        },
        {
          "name": "sequential_1/dense/bias",
          "shape": [ 128 ]
        },
        {
          "name": "sequential_1/dense_1/kernel",
          "shape": [ 128, 4 ]
        },
        {
          "name": "sequential_1/dense_1/bias",
          "shape": [ 4 ]
        }
      ]
    }
  ]
}
